OdGiContextualColorsImpl.setDefaultForType
\details
Sets up the default color and tint values for the currently specified type of vectorization context.

OdGiContextualColorsImpl.setContextualColorTint(OdGiContextualColors.ColorTint,System.Boolean)
\details
Sets a boolean value that indicates whether X, Y and Z axis color tinting is applied
to the specified interface element.
\param type [in]  Interface element.
\param bSet [in]  Boolean value to set.

OdGiContextualColorsImpl.setContextualColor(OdGiContextualColors.ColorType,System.UInt32!System.Runtime.CompilerServices.IsLong)
\details
Sets a color for the specified interface element.
\param type [in]  Interface element.
\param color [in]  Color to set.

OdGiContextualColorsImpl.setContextualColor(OdGiContextualColors.ColorType,OdCmEntityColor!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets a color for the specified interface element.
\param type [in]  Interface element.
\param color [in]  Color to set.

OdGiContextualColorsImpl.visualType
\details
Retrieves the type of vectorization context.
\returns
type of vectorization context.

OdGiContextualColorsImpl.setVisualType(OdGiContextualColorsImpl.VisualType)
\details
Sets a type of vectorization context.
\param type [in]  Context type to set.